;;;; 1.2.5 Нахождение наибольшего общего делителя

(defun gcd (a b)
  "Вернет наибольший общий делитель чисел A и B с помощью алгоритма Евклида"
  (message "(gcd (%d %d))" a b)
  (if (= b 0)
      a
    (message "(gcd %d (mob %d %d))" b a b)
    (gcd b (mod a b))))

;;; Упражнение 1.20

(gcd 206 40)

					; (gcd (206 40))
					;      (gcd 40 (mob 206 40))
					; (gcd (40 6))
					;       (gcd 6 (mob 40 6))
					; (gcd (6 4))
					;       (gcd 4 (mob 6 4))
					; (gcd (4 2))
					;       (gcd 2 (mob 4 2))
					; (gcd (2 0))

